app/Http/Controllers/User/CartController.php

    public function validateCart(Request $request)
    {
        try {
            $user = Auth::user();
            $restaurantHours = getRestaurantOpenTime();
            $now = date('H:i');

            if ($user->cart->coupon) {
                if (strtotime($user->cart->coupon->expiry_date . ' 23:59:59') < strtotime(now())) {
                    return response::json(['status' => 406, 'message' => "Coupon is expired."]);
                }
            }

            $outOfStockDishes = OrderDetail::with('dish')->whereHas('dish', function ($query) {
                $query->where('qty', 0)->orWhere('out_of_stock', '1');
            })->where([
                ['order_id', $user->cart->id],
                ['is_cart', '1']
            ])->get();
---
select * from `order_details` where `order_details`.`order_id` = 7 and `order_details`.`order_id` is not null and `dish_id` = '4'