app/Http/Controllers/User/CartController.php

select * from `order_dish_details` where `order_dish_details`.`order_detail_id` in (422)
---

                        $ing = DishIngredient::find($key);
                        $paidIngAmt += ($paidIng * $ing->price);
                        $orderDetails->orderDishDetails()->create([
                            'dish_id' => $id,
                            'dish_ingredient_id' => $key,
                            'is_free' => '0',
                            'quantity' => $paidIng,
                            'price' => $ing->price
                        ]);