app/Http/Controllers/User/CartController.php

update `orders` set `order_type` = '2', `orders`.`updated_at` = '2024-09-13 07:53:27' where `id` = 7
select * from `dishes` where `dishes`.`id` = '4' and `dishes`.`deleted_at` is null limit 1
---
    public function addCustomizedDish(Request $request, string $id)
    {
        if (!Auth::user()) {
            return response::json(['status' => 401, 'message' => '']);
        }

        try {
            $user = Auth::user();

            $user_id = $user->id;
            $order = $user->cart;
            $order_type = session('zipcode') == null ?  '2' : '1';
            if (empty($order)) {
                $order = $user->cart()->create([
                    'is_cart' => 1,
                    'order_type' => $order_type
                ]);
            } else {
                $order->order_type = $order_type;
                $order->save();
            }

            $order->fresh();
            $dish = Dish::find($id);

insert into `order_details` (`user_id`, `dish_id`, `price`, `qty`, `total_price`, `notes`, `order_id`, `updated_at`, `created_at`) values (1, '4', 12.95, '1', 12.95, '', 7, '2024-09-13 07:53:56', '2024-09-13 07:53:56')
---
                        "notes" => '',
                    ];

                    $orderDetails = $order->dishDetails()->create(
                        $cartArr
                    );

select * from `dish_ingredients` where `dish_ingredients`.`id` = 23 and `dish_ingredients`.`deleted_at` is null limit 1
insert into `order_dish_details` (`dish_id`, `dish_ingredient_id`, `is_free`, `quantity`, `price`, `order_detail_id`, `updated_at`, `created_at`) values ('4', 23, '0', '1', 1, 424, '2024-09-13 07:53:56', '2024-09-13 07:53:56')
---
                    if (isset($request->paidIng)) {
                        foreach ($request->paidIng as $key => $paidIng) {

                            $ing = DishIngredient::find($key);
                            $paidIngAmt += ((int)$paidIng * $ing->price);
                            $orderDetails->orderDishDetails()->create([
                                'dish_id' => $id,
                                'dish_ingredient_id' => $key,
                                'is_free' => '0',
                                'quantity' => $paidIng,
                                'price' => $ing->price
                            ]);