app/Http/Controllers/User/DishController.php

select * from `orders` where (`user_id` = 1 and `is_cart` = '1') limit 1
---
    public function getDishDetails(string $id)
    {
        if (!Auth::user()) {
            return response::json(['status' => 2, 'message' => '']);
        }

        $dish = Dish::find($id);

        $user = Auth::user();

        $user_id = $user->id;
        $order = Order::where([
            ['user_id', $user_id],
            ['is_cart', '1']
        ])->first();

        if (empty($order))
        {
            $order = new Order();
            $order->user_id = $user_id;
            $order->is_cart = '1';
            $order->save();
        }

        $dishDetail = $user->cart()
            ->with(['dishDetails' => function ($query) use ($id){
                $query->whereDishId($id)->whereIsCart('1');
            }])->first();

        $paidDishDetail = $order->dishDetails()->whereHas('orderDishPaidIngredients', function ($query) use ($id){
            $query->whereDishId($id)->whereIsCart('1');
        })->with('orderDishPaidIngredients')->first();

select * from `dishes` where `dishes`.`id` = '4' and `dishes`.`deleted_at` is null limit 1
---

        $options = $dish->option;
        $freeIngredients = $dish->freeIngredients;
        $paidIngredients = IngredientCategory::withWhereHas('ingredients', function($query) use ($id){
            $query->withWhereHas('paidDishIngredientWise', function($q)  use ($id) {
                $q->whereDishId($id);
            });
        })->get();