app/Helpers/CommonHelper.php

select * from `restaurant_details` where `restaurant_details`.`id` = 1 and `restaurant_details`.`deleted_at` is null limit 1
---
    function getRestaurantDetail()
    {
        $rest = RestaurantDetail::findOrFail(1);

select * from `dishes` where `dishes`.`id` = 17 limit 1
---
    function getOrderDishIngredients($dish)
    {
        $ingredients = '';

        $dishData = Dish::withTrashed()->find($dish->dish_id);

select * from `dishes` where `dishes`.`id` = '4' limit 1
---
    function getOrderDishIngredients1($dish)
    {
        $ingredients = '';

        $dishData = Dish::withTrashed()->find($dish->dish_id);

select * from `dish_options` where `dish_id` = 4 and `dish_options`.`deleted_at` is null
---
    function getDishOptionCategory($dishId)
    {
        $dishOptionCategoryData = [];
        $getDishOptionCategory = DishOption::with('dishCategoryOption')->where('dish_id', $dishId)->get();

select * from `dishes` where `dishes`.`id` = '4' limit 1
---
    function getOrderDishIngredientsTotal($dish)
    {
        $ingredients = '';
        $dishData = Dish::withTrashed()->find($dish->dish_id);