app/Http/Controllers/Admin/OrdersController.php

select `id` from `orders` where (`order_status` = '1' and `is_admin_notified` = '0')
update `orders` set `is_admin_notified` = '1', `orders`.`updated_at` = '2024-09-13 07:49:17' where 0 = 1
select * from `orders` where 0 = 1 order by `id` desc
---
    public function getNotNotifiedOrders(){
        try{
            $orderIds = Order::where([
                ['order_status', OrderStatus::Accepted],
               ['is_admin_notified', '0']
            ])->pluck('id');

            // Perform the update
            Order::whereIn('id', $orderIds)->update(['is_admin_notified' => '1']);

            // Fetch the updated records
            $orders = Order::whereIn('id', $orderIds)->orderBy('id', 'desc')->get();

select * from `orders` where `is_cart` = '0' and `order_status` <> '6' order by `id` desc
---
    public function archiveOrders(Request $request, $id = null)
    {
        $orders = Order::where('order_status', '6')
            ->where('updated_at', '<=', Carbon::now()->subHours(12))
            ->orderBy('id', 'desc');

        $openOrders = Order::where('is_cart', '0')->where('order_status','<>',OrderStatus::Delivered)->orderBy('id', 'desc')->get();

select * from `orders` where `orders`.`id` = '150' limit 1
---
    public function archiveOrderDetail(Request $request)
    {
        $order = Order::find($request->order_id);